Project/Toir/src/Documents/гкс_ЕВОБланк/гкс_ЕВОБланк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ЕВОБланк</name>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <registerRecords>InformationRegister.гкс_ОжидаемыеМероприятияЕвобланк</registerRecords>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КорневаяПричина</name>
    <type>
      <types>CatalogRef.гкс_КорневыеПричины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКорневойПричины</name>
    <type>
      <types>CatalogRef.гкс_ТипыКорневыхПричин</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВызоваТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНеисправности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДефектОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МерыПринятые</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорневаяПричинаТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазборТребуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕвоБланкПринят</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОстанова</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальникСмены</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДиаграммаСобытий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроблемы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроблем</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтветственности</name>
    <type>
      <types>EnumRef.гкс_ЗоныОтветственности</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ПовторныйОтказ</name>
    <comment>TOIR20-534</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МероприятияПоПредупреждению</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <comment>TOIR20-462</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Срок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АнализПричины</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РодительИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КорневаяПричина</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Documents/гкс_ЕВОБланк/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТемпСтрукт = новый Структура("ФормаСкопировать,ФормаСоздать", Неопределено, Неопределено);
	ЗаполнитьЗначенияСвойств(ТемпСтрукт,Элементы);
	Если Не ТемпСтрукт.ФормаСкопировать = Неопределено Тогда 
		Элементы.ФормаСкопировать.Доступность = Ложь;
		Элементы.ФормаСкопировать.Видимость = Ложь;
	КонецЕсли;
	Если Не ТемпСтрукт.ФормаСоздать = Неопределено Тогда 
		Элементы.ФормаСоздать.Доступность = Ложь;
		Элементы.ФормаСоздать.Видимость = Ложь;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаГлобальные;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	#Область ТекстЗапроса
	// гкс+ [10.23] Деснол 18.03.2024
	// в запрос добавлен подзапрос
	// гкс- [10.23] Деснол 18.03.2024
	Список.ТекстЗапроса = "ВЫБРАТЬ Различные
	|ДокТЧ.Ссылка КАК Ссылка
	|Поместить ВТ_НеВыполнено
	|ИЗ Документ.гкс_ЕВОБланк.МероприятияПоПредупреждению КАК ДокТЧ
	|Где ДокТЧ.Выполнено = Ложь
	|;
	|Выбрать
	                      |	Документгкс_ЕВОБланк.Ссылка КАК Ссылка,
	                      |	Документгкс_ЕВОБланк.ПометкаУдаления КАК ПометкаУдаления,
	                      |	Документгкс_ЕВОБланк.Номер КАК Номер,
	                      |	Документгкс_ЕВОБланк.Дата КАК Дата,
	                      |	Документгкс_ЕВОБланк.Проведен КАК Проведен,
	                      |	Документгкс_ЕВОБланк.СпособСогласования КАК СпособСогласования,
	                      |	Документгкс_ЕВОБланк.Организация КАК Организация,
	                      |	Документгкс_ЕВОБланк.Подразделение КАК Подразделение,
	                      |	ЕСТЬNULL(Спр.Наименование, Документгкс_ЕВОБланк.КорневаяПричинаТекст) КАК КорневаяПричина,
	                      |	Документгкс_ЕВОБланк.ТипКорневойПричины КАК ТипКорневойПричины,
	                      |	Документгкс_ЕВОБланк.ДокументОснование КАК ДокументОснование,
	                      |	Документгкс_ЕВОБланк.Ответственный КАК Ответственный,
	                      |	Документгкс_ЕВОБланк.ВремяНачалаОстановки КАК ВремяНачалаОстановки,
	                      |	Документгкс_ЕВОБланк.ВремяВызоваТС КАК ВремяВызоваТС,
	                      |	Документгкс_ЕВОБланк.ВремяЗапуска КАК ВремяЗапуска,
	                      |	Документгкс_ЕВОБланк.СтатусДокумента КАК СтатусДокумента,
	                      |	Документгкс_ЕВОБланк.ВидДефекта КАК ВидДефекта,
	                      |	Документгкс_ЕВОБланк.ИсторияСтатусов.(
	                      |		Ссылка КАК Ссылка,
	                      |		НомерСтроки КАК НомерСтроки,
	                      |		Дата КАК Дата,
	                      |		Пользователь КАК Пользователь,
	                      |		ЗаКого КАК ЗаКого,
	                      |		СтатусДокумента КАК СтатусДокумента
	                      |	) КАК ИсторияСтатусов,
	                      |	Документгкс_ЕВОБланк.Согласующие.(
	                      |		Ссылка КАК Ссылка,
	                      |		НомерСтроки КАК НомерСтроки,
	                      |		Согласующий КАК Согласующий,
	                      |		Согласовано КАК Согласовано,
	                      |		ПроведениеДокумента КАК ПроведениеДокумента,
	                      |		Порядок КАК Порядок,
	                      |		СтатусДокумента КАК СтатусДокумента,
	                      |		Замещающий КАК Замещающий
	                      |	) КАК Согласующие,
	                      |	Документгкс_ЕВОБланк.МероприятияПоПредупреждению.(
	                      |		Ссылка КАК Ссылка,
	                      |		НомерСтроки КАК НомерСтроки,
	                      |		Мероприятие КАК Мероприятие,
	                      |		Ответственный КАК Ответственный,
	                      |		Срок КАК Срок,
	                      |		Выполнено КАК Выполнено
	                      |	) КАК МероприятияПоПредупреждению,
	                      |	Документгкс_ЕВОБланк.АнализПричины.(
	                      |		Ссылка КАК Ссылка,
	                      |		НомерСтроки КАК НомерСтроки,
	                      |		Причина КАК Причина
	                      |	) КАК АнализПричины,
	                      |	Документгкс_ЕВОБланк.МоментВремени КАК МоментВремени,
	                      |	Документгкс_ЕВОБланк.ЕвоБланкПринят КАК ЕвоБланкПринят,
	                      |	Документгкс_ЕВОБланк.РазборТребуется КАК РазборТребуется,
						  |	ВТ_НеВыполнено.Ссылка есть NULL КАК МероприятияВыполнены
	                      |ИЗ
	                      |	Документ.гкс_ЕВОБланк КАК Документгкс_ЕВОБланк
						  |		Левое соединение ВТ_НеВыполнено КАК ВТ_НеВыполнено
						  |		ПО ВТ_НеВыполнено.Ссылка = Документгкс_ЕВОБланк.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_КорневыеПричины КАК Спр
	                      |		ПО Документгкс_ЕВОБланк.КорневаяПричина = Спр.Ссылка";
	#КОнецОбласти
	//
	НЭлем = Элементы.Добавить("Список_РазборТребуется", Тип("ПолеФормы"), Элементы.Список);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Список.РазборТребуется";
	//
	НЭлем = Элементы.Добавить("Список_ЕвоБланкПринят", Тип("ПолеФормы"), Элементы.Список);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Список.ЕвоБланкПринят";
	//
	// гкс+ [10.23] Деснол 18.03.2024
	НЭлем = Элементы.Добавить("Список_МероприятияВыполнены", Тип("ПолеФормы"), Элементы.Список);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Список.МероприятияВыполнены";
	// гкс- [10.23] Деснол 18.03.2024
	
	// гкс+ [Часовые пояса] Куст 14.04.2020
	Сдвиг = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	ТекстыЗамены = Новый Массив();
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документгкс_ЕВОБланк.Дата,",
		" ДобавитьКДате(ДокУментгкс_ЕВОБланк.Дата, Час, " + Сдвиг + ") КАК Дата,"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документгкс_ЕВОБланк.ВремяНачалаОстановки,",
		" ДобавитьКДате(ДокУментгкс_ЕВОБланк.ВремяНачалаОстановки, Час, " + Сдвиг + ") КАК ВремяНачалаОстановки,"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документгкс_ЕВОБланк.ВремяВызоваТС,",
		" ДобавитьКДате(ДокУментгкс_ЕВОБланк.ВремяВызоваТС, Час, " + Сдвиг + ") КАК ВремяВызоваТС,"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документгкс_ЕВОБланк.ВремяЗапуска,",
		" ДобавитьКДате(ДокУментгкс_ЕВОБланк.ВремяЗапуска, Час, " + Сдвиг + ") КАК ВремяЗапуска,"));
	Список.ТекстЗапроса = гкс_ЧасовыеПоясаВызовСервера.ИзменитьТекстЗапросаФормыСписка(
		Список.ТекстЗапроса, ТекстыЗамены);
	// гкс- [Часовые пояса] Куст 14.04.2020
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИфункции

&НаКлиенте
Процедура СоздатьНаОсновании(Команда)
	ОписаниеОповещенияПослеВыбора = Новый ОписаниеОповещения("СоздатьБланкПослеВыбораВД", ЭтотОбъект);
	ДопПараметры = Новый Структура("ОтборСтатусУстранен",Истина);
	ОткрытьФорму("Документ.торо_ВыявленныеДефекты.ФормаВыбора", ДопПараметры, ЭтотОбъект,,,,
		ОписаниеОповещенияПослеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБланкПослеВыбораВД(Результат, ДопПараметры)Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда 
		ОткрытьФорму("Документ.гкс_ЕВОБланк.ФормаОбъекта", Новый Структура("ДокументОснование",Результат));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
#КонецОбласти
